Catalogs/упАналитическиеРазрезыПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упАналитическиеРазрезыПоПартнерам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упАналитическиеРазрезыПоПартнерам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Сформировать наименование
//
// Параметры:
//  Организация - СправочникСсылка.Организации 	 - организация.
//  Партнер	 - СправочникСсылка.упПартнеры 	 - партнер.
//  Контрагент	 - СправочникСсылка.упКонтрагенты 	 - контрагент.
//  Соглашение	 - СправочникСсылка.упСоглашенияСКлиентами 	 - соглашение.
// 
// Возвращаемое значение:
//  Строка - наименование.
//
Функция СформироватьНаименование(Организация, Партнер, Контрагент, Соглашение) Экспорт
	мсвНаименование = Новый Массив;
	Если ЗначениеЗаполнено(Организация) Тогда
		мсвНаименование.Добавить(Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Партнер) Тогда
		мсвНаименование.Добавить(Партнер);
	КонецЕсли;
	Если ЗначениеЗаполнено(Контрагент) Тогда
		мсвНаименование.Добавить(Контрагент);
	КонецЕсли;
	Если ЗначениеЗаполнено(Соглашение) Тогда
		мсвНаименование.Добавить(Соглашение);
	КонецЕсли;
	Возврат СтрСоединить(мсвНаименование, ";");
КонецФункции

#КонецОбласти

#КонецЕсли
